def تعداد_روزهای_ماه(ماه, سال):
  """
  این تابع تعداد روزهای یک ماه را برمیگرداند

  """

  if ماه in (1, 3, 5, 7, 8, 10, 12):
    return 31
  elif ماه == 2:
    if سال % 4 == 0 and (سال % 100 != 0 or سال % 400 == 0):
      return 29
    else:
      return 28
  else:
    return 30

# دریافت ورودی از کاربر
ماه = int(input(" (1-12) Mah: "))
سال = int(input("Sal: "))

# محاسبه تعداد روزهای ماه
تعداد_روزها = تعداد_روزهای_ماه(ماه, سال)

# نمایش خروجی
print(f"Mah {ماه} , Sal {سال} Daraye: {تعداد_روزها} Roz ast.")
